n = 17  # целочисленный литерал
num = int(input())  # преобразование считанной строки в целое число
n = int("12345")  # преобразование строки в целое число


num = int("123!A")  # Error!
num = int("2.5")  # Error!


a = 13
b = 7
total = a + b
diff = a - b
prod = a * b
div1 = a / b
div2 = a // b
mod = a % b
exp = a**b

print(a, "+", b, "=", total)  # 13 + 7 = 20
print(a, "-", b, "=", diff)  # 13 - 7 = 6
print(a, "*", b, "=", prod)  # 13 * 7 = 91
print(a, "/", b, "=", div1)  # 13 / 7 = 1.8571428571428572
print(a, "//", b, "=", div2)  # 13 // 7 = 1
print(a, "%", b, "=", mod)  # 13 % 7 = 6
print(a, "**", b, "=", exp)  # 13 ** 7 = 62748517


e = 2.71828  # литерал с плавающей точкой
pi = 3.1415  # литерал с плавающей точкой

num = float(input())  # преобразование считанной строки в число с плавающей точкой
n = float("1.2345")  # преобразование строки к числу с плавающей точкой


a = 13.5
b = 2.0

total = a + b
diff = a - b
prod = a * b
div = a / b
exp = a**b

print(a, "+", b, "=", total)  # 13.5 + 2.0 = 15.5
print(a, "-", b, "=", diff)  # 13.5 - 2.0 = 11.5
print(a, "*", b, "=", prod)  # 13.5 * 2.0 = 27.0
print(a, "/", b, "=", div)  # 13.5 / 2.0 = 6.75
print(a, "**", b, "=", exp)  # 13.5 ** 2.0 = 182.25

# Встроенные функции
# print() – вывести на экран
# input() – считать с клавиатуры
# int() – преобразовать к целому числу
# float() – преобразовать к числу с плавающей точкой


# Функции min() и max()
a = max(3, 8, -3, 12, 9)
b = min(3, 8, -3, 12, 9)
c = max(3.14, 2.17, 9.8)
print(a)  # 12
print(b)  # -3
print(c)  # 9.8

# Функция abs()
print(abs(10))  # 10
print(abs(-7))  # 7
print(abs(0))  # 0
print(abs(-17.67))  # -17.67
